[
    {
        "name": "The God of Small Things",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/fa6e004c5_53048.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Arundhati Roy",
        "price": "810",
        "stock": "8",
        "summary": "The God of Small Things is the debut novel of Indian writer Arundhati Roy. It is a story about the childhood experiences of fraternal twins whose lives are destroyed by the 'Love Laws' that lay down 'who should be loved, and how. And how much.' The book explores how the small things affect people's behavior and their lives. It won the Booker Prize in 1997. ndian history and politics shape the plot and meaning of The God of Small Things in a variety of ways. Some of Roy's commentary is on the surface, with jokes and snippets of wisdom about political realities in India. However, the novel also examines the historical roots of these realities and develops profound insights into the ways in which human desperation and desire emerge from the confines of a firmly entrenched caste society. The story is set in the caste society of India, at a time when members of the Untouchable Paravan or Paryan caste were not permitted to touch members of higher castes or enter their houses. The Untouchables were considered polluted beings. They had the lowliest jobs and lived in subhuman conditions. In India, the caste system was considered a way to organize society. Roy's book shows how terribly cruel such a system can be. However, Roy shows other types of less evident discrimination. For example, there is religious discrimination. It is unacceptable for a Syrian Christian to marry a Hindu and vice versa, and Hindus can only marry a Hindu from the same caste. In more than one passage of the book, the reader feels Rahel's and Estha's discomfort at being half Hindu. Baby Kochamma constantly makes disparaging comments about Hindus. On the other hand, there is discomfort even between Christian denominations as is shown by Pappachi's negative reaction when Baby Kochamma converts to Catholicism."
    },
    {
        "name": "Game of Thrones",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/2d781e4fb_69527.jpg",
        "category": "Fantasy and adventure",
        "language": "English",
        "author": "George R. R. Martin",
        "price": "1200",
        "stock": "3",
        "summary": "Full of adventure, mystery, intrigue, and romance, Game Of Thrones: A Song Of Ice And Fire (Book- 1) TV Tie-in Edition is a fitting opening to one of the most popular fantasy fiction series. The book contains supernatural elements which revolve around the seasons which last decades. The summer is ending and winter is fast approaching. As the cold is on its way back, it is bringing along with it deadly forces. Beyond the protective walls of the kingdom, in the frozen wastes, supernatural forces are making their way to the world of men. In this battle for the throne, replete with death, plunder, tragedy, betrayal, terror, and treachery, two families take centre stage, the Starks and the Lannisters. Lord Eddard Stark, the newly appointed ‘Hand’ of King Robert, has to defend the Iron throne. What happens to King Robert? What does Ned Stark discover that makes him the enemy of the Queen? Will Sansa Stark marry Joffrey? Who is Daenerys Targaryen and how will her actions affect Westeros? This fantasy adventure tale, which takes place in a land of magic, dragons, and supernatural creatures, keeps readers spellbound till the very end. Published in 1996, Game Of Thrones: A Song Of Ice And Fire (Book- 1) TV Tie-in Edition became a New York Times bestseller. The novel received the Locus Award, the Hugo Award, and the Ignotus Award. It was also nominated for the World Fantasy Award and the Nebula Award. The series was adapted into an HBO television series, which premiered in 2011."
    },
    {
        "name": "The Autobiography of an Unknown Indian",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/a3d4df1a6_86664.jpg",
        "category": "Biography",
        "language": "English",
        "author": "Niradchondro Chaudhuri",
        "price": "898",
        "stock": "9",
        "summary": "The Autobiography of an Unknown Indian is the 1951 autobiography of Nirad C. Chaudhuri, an Indian writer.[1][2] Written when he was around 50, it records his life from his birth in 1897 in Kishorganj, a small town in present-day Bangladesh. The book relates his mental and intellectual development, his life and growth in Calcutta, his observations of vanishing landmarks, the connotation of this is dual—changing Indian situation and historical forces that was making exit of British from India an imminent affair."
    },
    {
        "name": "The Grand Design",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/942f91af9_90985.jpg",
        "category": "Science and technologies",
        "language": "English",
        "author": "Stephen Hawking",
        "price": "1078",
        "stock": "2",
        "summary": "The Grand Design: New Answers To The Ultimate Questions Of Life explores the history of human efforts to unravel the puzzles of the Universe. It starts with the Greeks. Particularly the Ionian Greeks and their contention that the the Universe had to have a cause based on the laws of science. It covers landmark discoveries, like that of Copernicus who showed that the Earth was not the center of the Universe. It explains the various laws of physics that have provided answers to so many things that have puzzled people for long. The authors show that the Theory of Relativity and Quantum Physics have together helped humans understand many of the deep mysteries about the Universe. But the quest to find a single theory, a unified theory that will explain everything about everything has been elusive. This Theory of Everything was a dream of Einstein, and other scientists have continued the quest. The Theory of Everything has had several candidates, and the latest is the M-Theory which the authors present as the most likely solution. They contend that the new discoveries make God unnecessary. They say that the laws of physics show that the Universe is a result of spontaneous creation. They also explore the M-Theory further and explain that just like ours is not the only galaxy in the Universe, our Universe is not the only one out there. In fact, there might be one universe for each possible outcome of a situation, so the Universe that a person sees is a perception of reality from their viewpoint. They also propose that these universes could be so vastly different, some may not be capable of supporting life forms. The Grand Design: New Answers To The Ultimate Questions Of Life is an intriguing exploration of all the discoveries that revealed the secrets of the Universe, and where science could proceed from now. It explains how physics could soon provide the ultimate answers to all the mysteries of the Universe."
    },
    {
        "name": "Success Through A Positive Mental Attitude",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/5f811ae63_71578.jpg",
        "category": "Phycology",
        "language": "English",
        "author": "Napoleon Hill, W. Clement Stone",
        "price": "405",
        "stock": "12",
        "summary": "Your mind has a secret invisible talisman. On one side is emblazoned the letters PMA (positive mental attitude) and on the other the letters NMA (negative mental attitude). A positive attitude will naturally attract the good and the beautiful. The negative attitude will rob you of all that makes life worth living. Your success, health, happiness, and wealth depend on how you make up your mind!"
    },
    {
        "name": "Communist Manifesto",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/eca188310_84885.jpg",
        "category": "History",
        "language": "English",
        "author": "Karl Marx, Friedrich Engels",
        "price": "450",
        "stock": "10",
        "summary": "The Communist Manifesto, which was originally titled as Manifesto of the Communist Party, is an influential political manuscript that lays out the Communist League’s aims and program. The Manifesto presents an analytical insight into the class struggle of the historical and contemporary era. The book also highlights the problems of capitalism. The Communist Manifesto is divided into 4 sections. The first part is Bourgeois and Proletarians. It focuses on the Communist theory of the history and relation between the Bourgeois and the Proletarians. The next section, Proletarians and Communists, attempts to understand the relationship between Proletarians and Communists. The third part discusses the Socialist and Communist Literature and their flaws. The final part discusses the position of the Communists and its relation to the other opposition parties. This edition of The Communist Manifesto has been edited by Gareth Stedman Jones. In this edition, he discusses The Reception of the Manifesto, The Communist League, The Spectre of Communism, and Engel’s and Marx’s contributions. Gareth Stedman Jones also discusses the The Young Hegelians including Hegel and Hegelianism, the Emergence of the Young Hegelians, and the Battle over Christianity. It also discuses the Political Economy, Communism, The True Natural History of Man, The Impact of Stirner, and the transformation from Republicanism to Communism. Written after 4 years of collaboration between Engel and Marx, The Communist Manifesto was originally written in German and published on 21 February 1848. When it was originally published, it raised much controversy. Today, it is an important manifesto, a powerful historical document, and an important classical work."
    },
    {
        "name": "Veronika Decides to Die",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/Veronika_Decides_to_Die-Paulo_Coelho-9b212-52998.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Paulo Coelho",
        "price": "718",
        "stock": "18",
        "summary": "Veronika has everything that a young woman can think of having, but still isn’t satisfied with this as she feels a void within her. As she feels that nothing can fill this void she decides one fine day that she is going to die and consumes several sleeping pills. While she is surprised to find herself still alive when she wakes up in a local mental hospital, she is told that her wish to die will come true in a matter of days as the overdose on the pills has caused irreparable damage to her heart. However, it is in these last few days of life that Veronika starts to actually appreciate things around her. She starts to feel things that she has never felt before like: love, fear, hatred, sexual awakening and curiosity."
    },
    {
        "name": "Making India Awesome",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/24a76bd38_105425.jpg",
        "category": "Research",
        "language": "English",
        "author": "Chetan Bhagat",
        "price": "351",
        "stock": "18",
        "summary": "Love your country? Want to make it truly great? Tired of loud debates and complex arguments which lead to no solutions?"
    },
    {
        "name": "Harry Potter and the Deathly Hallows (Series-7)",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/Harry_Potter_and_the_Deathly_Hallows_(Se-J.K_Rowling-699a7-122325.jpg",
        "category": "Fantasy and adventure",
        "language": "English",
        "author": "J.K. Rowling",
        "price": "1258",
        "stock": "12",
        "summary": "Following another deeply troubled year at Hogwarts, described in Harry Potter and the Half-Blood Prince, at the end of which Dumbledore is killed by the ever-deceptive Severus Snape, Harry begins the final volume of the series in hiding. When the spell that has kept him safe until his seventeenth birthday expires, he and his helpers are immediately attacked by Voldemort, suffering casualties. Unable to return to Hogwarts, Harry is forced to go on the run with Ron and Hermione, hunting desperately for the “horcruxes” that contain fragments of Voldemort’s soul and thus maintain his invulnerability. The search for the horcruxes is complicated when Harry learns of the existence of another set of magical objects—the “deathly hallows”—which might also be vital to the settlement of the final battle. Voldemort is unable to give his complete attention to the quest to kill Harry because he is searching for one of the hallows: an undefeatable wand. Uncertain as to whether to give priority to the remaining horcruxes or the hallows, Harry continues to evade death, albeit narrowly, until he is forced to return to Hogwarts in order to complete his search. The castle housing Hogwarts Academy then becomes the last fortress holding out against Voldemort’s rise to power, subject to intensive siege and violent bombardment. The remnants of Dumbledore’s Army and the Order of the Phoenix mount a heroic defense of Hogwarts in the attempt to win Harry enough time to finish his quest, suffering heavy casualties in the process. The conflict reaches the limit of desperation when it becomes evident that Harry harbors one of the fragments of Voldemort’s soul in his own flesh. It appears that Harry cannot kill his enemy without sacrificing himself in the process, but that sacrifice might also make Voldemort invincible."
    },
    {
        "name": "An Autobiography Mahatma Gandhi : The Story of My Experiments With Truth",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/6f06eb04c_71679.jpg",
        "category": "Philosophy",
        "language": "English",
        "author": "Mohandas karamchand Gandhi",
        "price": "288",
        "stock": "7",
        "summary": "The first part narrates incidents of Gandhi's childhood, his experiments with eating meat, smoking, drinking, stealing and subsequent atonement. There are two texts that had a lasting influence on Gandhi, both of which he read in childhood. He records the profound impact of the play Harishchandra and says,'I read it with intense interest...It haunted me and I must have acted Harishchandra to myself times without number.' Another text he mentions reading that deeply affected him was Shravana Pitrabhakti Nataka, a play about Shravana's devotion to his parents. Gandhi got married at the age of 13. In his words, 'It is my painful duty to have to record here my marriage at the age of thirteen...I can see no moral argument in support of such a preposterously early marriage.' Another important event documented in this part is the demise of Gandhi's father Karamchand Gandhi. Gandhi wrote the book to deal with his experiment for truth. His disdain for physical training at school, particularly gymnastics has also been written about in this part."
    },
    {
        "name": "Practicing The Power Of Now",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/ac5152381_100986.jpg",
        "category": "Phycology",
        "language": "English",
        "author": "Eckhart Tolle",
        "price": "538",
        "stock": "2",
        "summary": "Practicing The Power Of Now: Essential Teachings, Meditations And Exercises From The Power Of Now is a selection of excerpts from his book, The Power Of Now. In the book, the author shares with the readers the enlightenment that he experienced after a life-changing transformation. His teachings guide the readers on a path that promises them a way to avoid being a slave to their minds. His teachings are also not bound to any particular doctrine, religion, or guru. The focus is on helping the readers achieve a heightened state of consciousness, which remains with them all through their day. The book consists of specific exercises and keys along with simple techniques that aim at helping the reader find something that may lead to a life-changing experience. It also acts as a guide to the readers in discovering a place in their minds that is quiet and still, where problems seem to disseminate giving way to a much more liberated life. Practicing The Power Of Now: Essential Teachings, Meditations And Exercises From The Power Of Now is written in a manner that promises the reader in discovering a spiritual awakening over time. By using this book as a reference guide at any point in time, the readers are sure to find something that is of immense significance, not only to their lives, but also to the world at large. It equips the reader with the power to attain a calm and joy that is hidden amidst the trials and tribulations of daily life, and elevate their existence."
    },
    {
        "name": "Winning",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/4df616828_101017.jpg",
        "category": "Phycology",
        "language": "English",
        "author": "Jack Welch, Suzy Welch",
        "price": "800",
        "stock": "5",
        "summary": "Winning, published in 2010, is a self-help management guide to help readers find answers to some of the most difficult questions of their professional lives. Winning starts off with an introduction, where Jack Welch says that the most commonly asked question is, What does it take to win? The first part of the book, Underneath It All, describes Jack’s management philosophy. The author says that an organization should take ideas from every level, and not just the top leaders. The next part is titled Your Company, and focuses on the inner working of an organization. The authors speak about leadership, hiring, how to part ways, and crisis management. Your Competition is the third portion of Winning, and it speaks about the world outside of an organization. Readers will learn how to devise meaningful budgets, grow through mergers and acquisitions, create strategic advantages, and make use of Six Sigma. In Your Career, the authors encourage readers to find the right job, to understand what it takes to get promoted, and learn how to handle a bad boss. Winning also says that maintaining a good work-life balance is essential. The last part, Tying Up Loose Ends, answers nine questions that do not fall in the above categories, like managing the China threat. Winning is filled with personal stories and experiences, and has been written with a no-nonsense attitude. This book offers no easy solutions on how to win, as there really are none. This guide was on the top of The Wall Street Journal bestseller list, and has also been on The New York Times' bestseller list."
    },
    {
        "name": "The Difference: When Good Enough isn't Enough",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/535a34264_164695.jpg",
        "category": "Business",
        "language": "English",
        "author": "Subir Chowdhury",
        "price": "358",
        "stock": "15",
        "summary": "This seemingly innocuous question was posed to Subir Chowdhury by one of his longtime clients, and ultimately lead him to a profound realization: good enough is not enough. The best processes in the world won't work without developing the kind of mindset — a caring mindset — that is needed to achieve real and sustainable change in both organizations and individuals. In his compelling new book, bestselling author and globally recognized management consultant Subir Chowdhury tackles an issue that has haunted him in his work with many of the world’s largest organizations. Why is it that some improve only incrementally, while others improve 50 times that? The ideas and training are exactly the same. What is the difference? The difference, Chowdhury explains, is the ability to nurture the skills, loyalty and passion of the people who make up an organization. It is a culture built on straightforwardness, thoughtfulness, accountability and resolve. Organizations and individuals that embrace all of these “STAR” attributes—not just one or two of them—will shine. He goes further, showing us why having a caring mindset outside of work is integral to both personal and professional success. A powerful guide to living a successful life and career, The Difference will inspire you to be the difference — at work or home."
    },
    {
        "name": "The Sense of An Ending",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/3a4367a7c7e4_52931.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Julian Barnes",
        "price": "718",
        "stock": "3",
        "summary": "The Sense of an Ending is a 2011 novel written by British author Julian Barnes. The book is Barnes' eleventh novel written under his own name (he has also written crime fiction under the pseudonym Dan Kavanagh) and was released on 4 August 2011 in the United Kingdom. The Sense of an Ending is narrated by a retired man named Tony Webster, who recalls how he and his clique met Adrian Finn at school and vowed to remain friends for life. When the past catches up with Tony, he reflects on the paths he and his friends have taken. In October 2011, The Sense of an Ending was awarded the Man Booker Prize. The following month it was nominated in the novels category at the Costa Book Awards."
    },
    {
        "name": "Brida",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/75ee8238e_56184.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Paulo Coelho",
        "price": "512",
        "stock": "4",
        "summary": "The spellbinding new novel from one of the world's best-loved authors, Paulo Coelho, recounting the story of Brida, and her pursuit of wisdom. This is the story of Brida, a young Irish girl, and her quest for knowledge. She has long been interested in various aspects of magic, but is searching for something more. Her search leads her to people of great wisdom, who begin to teach her about the world. Her teachers sense that Brida has a gift, but cannot tell what that is. Meanwhile, Brida pursues her course ever deeper into the mysteries of life, seeking to answer questions about who she is. She meets a wise man who dwells in a forest, and teaches her about overcoming her fears and trusting in the goodness of the world, and a woman who teaches her how to dance to the music of the world, and how to pray to the moon. She seeks her destiny, as she struggles to find a balance between her relationships and her desire to become a witch. This enthralling novel incorporates themes fans of Paulo will love. It is a tale of love, passion, mystery and spirituality."
    },
    {
        "name": "The Catcher in the Rye",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/b38578624_84881.jpg",
        "category": "Novel",
        "language": "English",
        "author": "J.D. Sallinger",
        "price": "612",
        "stock": "6",
        "summary": "Holden Caulfield is the protagonist of The Catcher In The Rye. He is portrayed by Salinger as a boy who is lazy and uncertain about his future. The story begins at Pencey Preparatory school, at which Holden is a student. In this first-person narrative, Holden describes life at this preparatory school as phoney, artificial, and dreary. After receiving yet another set of inadequate grades, he is expelled from the school. In an effort to 'find himself', Holden decides to head to New York City, where he heads underground. He narrates his adventures there in a 3-day flashback, which forms the basis of Salinger’s story. In New York City, Holden encounters a variety of experiences and adventures which bring him along on his path to self discovery. For instance, he encounters three women in their thirties, who dance and flirt with him. After observing what he assumes is a sex scene through a hotel window, Holden decides to invite a prostitute to his room. Adding to his 'adventures' are experiences with nuns, wayward taxi drivers, alcohol, and drugs. As Holden sinks deeper and deeper into this debaucherous lifestyle, a chance meeting with his sister Phoebe supplies Holden with just enough affection to yank him out of his 'madness'. The frequent use of profanity and colloquialism by Salinger adds an element of realism to the characters, and is indicative of 'teenage behaviour'. The book promises to be an inspirational read for teenagers and adults alike who are facing or have faced similar mountains. The Catcher In The Rye was originally published in 1951. It has been chosen as the best novel of the 20th century by The New York Times. Even though it was initially met with much hesitation by many concerned parents, it still managed to sell over two and a half million copies worldwide. Time magazine listed the book as one of the '100 Best English Novels Written'."
    },
    {
        "name": "Midnights Children",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/0900b49b3fb4_53224.gif",
        "category": "Novel",
        "language": "English",
        "author": "Salman Rushdie",
        "price": "898",
        "stock": "2",
        "summary": "Midnight's Children is a loose allegory for events in India both before and, primarily, after the independence and partition of India. The protagonist and narrator of the story is Saleem Sinai, born at the exact moment when India became an independent country. He was born with telepathic powers, as well as an enormous and constantly dripping nose with an extremely sensitive sense of smell. The novel is divided into three books. The book begins with the story of the Sinai family, particularly with events leading up to India's Independence and Partition. Saleem is born precisely at midnight, 15 August 1947, therefore, exactly as old as independent India. He later discovers that all children born in India between 12 a.m. and 1 a.m. on that date are imbued with special powers. Saleem, using his telepathic powers, assembles a Midnight Children's Conference, reflective of the issues India faced in its early statehood concerning the cultural, linguistic, religious, and political differences faced by a vastly diverse nation. Saleem acts as a telepathic conduit, bringing hundreds of geographically disparate children into contact while also attempting to discover the meaning of their gifts. In particular, those children born closest to the stroke of midnight wield more powerful gifts than the others. Shiva 'of the Knees', Saleem's nemesis, and Parvati, called 'Parvati-the-witch,' are two of these children with notable gifts and roles in Saleem's story. Meanwhile, Saleem's family begin a number of migrations and endure the numerous wars which plague the subcontinent. During this period he also suffers amnesia until he enters a quasi-mythological exile in the jungle of Sundarban, where he is re-endowed with his memory. In doing so, he reconnects with his childhood friends. Saleem later becomes involved with the Indira Gandhi-proclaimed Emergency and her son Sanjay's 'cleansing' of the Jama Masjid slum. For a time Saleem is held as a political prisoner; these passages contain scathing criticisms of Indira Gandhi's over-reach during the Emergency as well as a personal lust for power bordering on godhood. The Emergency signals the end of the potency of the Midnight Children, and there is little left for Saleem to do but pick up the few pieces of his life he may still find and write the chronicle that encompasses both his personal history and that of his still-young nation, a chronicle written for his son, who, like his father, is both chained and supernaturally endowed by history."
    },
    {
        "name": "The Biology of Belief : Unleashing The Power of Consciousness, Matter and Miracles",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/550e9d4b6ae4_117091.gif",
        "category": "Phycology",
        "language": "English",
        "author": "Bruce H. Lipton",
        "price": "712",
        "stock": "3",
        "summary": "The Biology of Belief has been updated to bolster the book’s central premise with the latest scientific discoveries—and there have been a lot in the last decade. The Biology of Belief is a groundbreaking work in the field of new biology. Former medical school professor and research scientist Bruce H. Lipton, Ph.D., presents his experiments, and those of other leading-edge scientists, which examine in great detail the mechanisms by which cells receive and process information. The implications of this research radically change our understanding of life, showing that genes and DNA do not control our biology; instead, DNA is controlled by signals from outside the cell, including the energetic messages emanating from our positive and negative thoughts. This profoundly hopeful synthesis of the latest and best research in cell biology and quantum physics has been hailed as a major breakthrough, showing that our bodies can be changed as we retrain our thinking."
    },
    {
        "name": "The Bastard of Istanbul",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/23f040d02_85360.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Elif Shafak",
        "price": "800",
        "stock": "13",
        "summary": "Twenty years later, Asya Kazanci lives with her extended family in Istanbul. Due to a mysterious family curse, all the Kazanci men die in their early forties, so it's a house of women, among them Asya's beautiful, rebellious mother who runs a tattoo parlour; Banu, who has newly discovered herself as a clairvoyant; and Feride, a hypochondriac obsessed with impending disaster. And when Asya's cousin comes to stay, long-hidden family secrets connected with Turkey's turbulent past begin to emerge."
    },
    {
        "name": "For Whom The Bell Tolls",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/rokimg20141031_90990.gif",
        "category": "Novel",
        "language": "English",
        "author": "Ernest Hemingway",
        "price": "715",
        "stock": "1",
        "summary": "Robert Jordan is a young American with the International Brigades attached to an antifascist guerilla unit in the mountains of Spain. He is an experienced dynamiter, and he is tasked by a communist Russian general to travel behind enemy lines and destroy a bridge with the aid of a band of local anti-fascist guerrillas. This way, the general assures him, the enemy troops would not be able to respond to an upcoming offensive. In the Spanish camp, Robert Jordan meets María, a young Spanish woman. She is scarred from her parents’ execution and her rape at the hands of the Falangists. He begins to fall for her, and his feelings spark a lust for life deep within him. Hemingway’s epic novel of war and love has become a signature tale of courage and loyalty, love and defeat, and the demise of an ideal in the tragedy of one man’s stance against all odds."
    },
    {
        "name": "The last Mughal : The Fall of a dynasty delhi 1857",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/1d6c8b2c2994_69007.gif",
        "category": "History",
        "language": "English",
        "author": "William Dalrymple",
        "price": "1258",
        "stock": "2",
        "summary": "At 4 p.m. on a hazy, humid winter's afternoon in Rangoon in November 1862, soon after the end of the monsoon, a shrouded corpse was escorted by a small group of British soldiers to an anonymous grave at the back of a walled prison enclosure. This enclosure lay overlooking the muddy brown waters of the Rangoon river, a little downhill from the great gilt spire of the Shwe Dagon pagoda. Around the enclosure lay the newly constructed cantonment area of the port - an anchorage and pilgrimage town that had been seized, burned and occupied by the British only ten years earlier. The bier of the State Prisoner - as the deceased was referred to - was accompanied by two of his sons and an elderly, bearded mullah. No women were allowed to attend, and a small crowd from the bazaar who had somehow heard about the prisoner's death were kept away by armed guards. Nevertheless, one or two managed to break through the cordon to touch the shroud before it was lowered into the grave. The ceremony was brief. The British authorities had made sure not only that the grave was already dug, but that quantities of lime were on hand to guarantee the rapid decay of both bier and body. When the shortened funeral prayers had been recited - no lamentations or panegyrics were allowed - the earth was thrown in over the lime, and the turf carefully replaced so that within a month or so no mark would remain to indicate the place of burial. A week later the British Commissioner, Captain H. N. Davies, wrote to London to report what had passed, adding. Have since visited the remaining State Prisoners - the very scum of the reduced Asiatic harem; found all correct. None of the family appear much affected by the death of the bed-ridden old man. His death was evidently due to pure decrepitude and paralysis in the region of the throat. He expired at 5 o'clock on the morning of the funeral. The death of the ex-King may be said to have had no effect on the Mahomedan part of the populace of Rangoon, except perhaps for a few fanatics who watch and pray for the final triumph of Islam. A bamboo fence surrounds the grave for some considerable distance, and by the time the fence is worn out, the grass will again have properly covered the spot, and no vestige will remain to distinguish where the last of the Great Moghuls rests."
    },
    {
        "name": "Aleph",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/rokimg_2111_52290.GIF",
        "category": "Novel",
        "language": "English",
        "author": "Paulo Coelho",
        "price": "715",
        "stock": "2",
        "summary": "Aleph marks a return to Paulo Coelho's beginnings. In a frank and surprising personal story, one of the world's most beloved authors embarks on a remarkable and transformative journey of self- discovery. Facing a grave crisis of faith, and seeking a path of spiritual renewal and growth, Paulo decides to start over: to travel, to experiment, to reconnect with people and the world. On this journey through Europe, Africa, and Asia, he will again meet Hilal—the woman he loved 500 years before—an encounter that will initiate a mystical voyage through time and space, through past and present, in search of himself. Aleph is an encounter with our fears and our sins; a search for love and forgiveness, and the courage to confront the inevitable challenges of life."
    },
    {
        "name": "Fooled by Randomness: The Hidden Role",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/f876ca611_90775.jpg",
        "category": "Business",
        "language": "English",
        "author": "Nassim nicholas taleb",
        "price": "1078",
        "stock": "21",
        "summary": "Our lives and specifically the market are so full of random aspects and complex structures. Understanding the behaviour of markets and attributing specific reasons to its behaviour is totally impossible and sometimes a useless task. As the title explains, Taleb’s theory explains how all of us get fooled easily by randomness. Taleb goes on to elaborate how we misconstrue luck and skill. Wherever true luck plays a role, we assume it to be the work of individual skill. Most impressive situations in life are only due to luck, claims Taleb. He uses the theory of black swans (rare events) to propound his idea and says that black swans cannot be predicted. Taleb elucidates his theory through some popular examples using people like the baseball expert Yogi Berra, the philosopher Karl Popper, the ancient wise man Solon, the financier George Soros and the Greek voyager Odysseus. Most of all, journalists and traders fall for the randomness as well. In addition to real-life examples, Taleb also brings in the case of the fictitious hero Nero, who is smart enough to understand the play of randomness in his professional life, but is superstitiously foolish.  Taleb also constructs an invincible, nameless fool who seems to be at the right place at the right time. The fool has a steady string of followers who are ready to do anything for their Guru. But, the fool’s actions cannot be imitated. His success is one obtained by chance. The most unexpected things will happen for sure. But, we become creatures of routine that we fail to identify it when it happens. Moreover, detecting risks and accepting them is done only by the emotional part of the brain. If we understand probability, then we can perceive the role of luck in everyday situations. The trick lies in recognizing it. Taleb says we must be aware of the trap that luck sets for us. How do we distinguish a lucky poseur from a far-sighted visionary? How do we read an incident? How do we decide whether it is luck or talent that made the person successful?"
    },
    {
        "name": "In The Light Of What We Know",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/58b7a626d_125942.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Zia Haider Rahman",
        "price": "898",
        "stock": "5",
        "summary": "One September morning in 2008, an investment banker approaching forty, his career in collapse and his marriage unraveling, receives a surprise visitor at his West London townhouse. In the disheveled figure of a South Asian male carrying a backpack, the banker recognizes a long-lost friend, a mathematics prodigy who disappeared years earlier under mysterious circumstances. The friend has resurfaced to make a confession of unsettling power. In the Light of What We Know takes us on a journey of exhilarating scope--from Kabul to London, New York, Islamabad, Oxford, and Princeton--and explores the great questions of love, belonging, science, and war. It is an age-old story: the friendship of two men and the betrayal of one by the other. The visitor, a man desperate to climb clear of his wrong beginnings, seeks atonement; and the narrator sets out to tell his friend's story but finds himself at the limits of what he can know about the world--and, ultimately, himself. Set against the breaking of nations and beneath the clouds of economic crisis, this surprisingly tender novel chronicles the lives of people carrying unshakable legacies of class and culture as they struggle to tame their futures. In an extraordinary feat of imagination, Zia Haider Rahman has telescoped the great upheavals of our young century into a novel of rare intimacy and power."
    },
    {
        "name": "The Elegant Universe",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/969f85a96_90976.jpg",
        "category": "Science and technologies",
        "language": "English",
        "author": "Brian Greene",
        "price": "1258",
        "stock": "3",
        "summary": "Brian Greene is one of the world’s foremost authorities on string theory. In this book, he tries to explain how the universe is actually comprised of 11 dimensions. In this theory, all matter is generated through the vibrations of microscopic loops of energy. Greene uses lively examples from all spheres of life, from an amusement park ride to ants on a garden hose to explain how physics is changing mankind’s understanding of the universe. The book is both enlightening and entertaining in its approach towards modern physics and the string theory. All science enthusiasts will definitely enjoy reading it."
    },
    {
        "name": "Speaking Of Films",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/5952950208d4_84874.jpg",
        "category": "Criticism",
        "language": "English",
        "author": "Satyajit Ray",
        "price": "538",
        "stock": "2",
        "summary": "India's greatest film-maker on the art and craft of films Exactly fifty years ago, in 1955, the release of Pather Panchali heralded the arrival of a master in the world of cinema. Over the next forty years, Satyajit Ray came to be regarded as one of the world's finest film-makers ever. Today, more than a decade after his death, he continues to be India's most respected name in international film circles. Apart from his achievements as a director, Ray was also a prolific writer of novels, short stories, and essays on cinema. Speaking of Films brings together some of Ray's most memorable writings on film and film-making. With the masterly precision and clarity that characterize his films, Ray discusses a wide array of subjects: the structure and language of cinema with special reference to his adaptations of Tagore and Bibhuti Bhushan Bandopadhyay, the appropriate use of background music and dialogue in films, the relationship between a film-maker and a film critic, and important develoents in cinema like the advent of sound and colour. He also writes about his own experiences, the challenges of working with rank amateurs, and the innovations called for when making a film in the face of technological, financial and logistical constraints. In the process, Ray provides fascinating behind-the-scenes glimpses of the people who worked with him the intricacies of getting Chhabi Biswas, who had no ear for music, to play a patron of classical music in Jalsaghar; the incredible memory of the seventy-five-year-old Chunibala Devi, Indir Thakrun of Pather Panchali, and her remarkable attention to details. This first-ever translation of Bishay Chalachitra, a seminal collection of essays on cinema, Speaking of Films retains the lucidity and simplicity that is a hallmark of Ray's writing, and gives an invaluable insight into the mind of a genius."
    },
    {
        "name": "Speaking Of Films",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/5952950208d4_84874.jpg",
        "category": "Criticism",
        "language": "English",
        "author": "Satyajit Ray",
        "price": "538",
        "stock": "2",
        "summary": "India's greatest film-maker on the art and craft of films Exactly fifty years ago, in 1955, the release of Pather Panchali heralded the arrival of a master in the world of cinema. Over the next forty years, Satyajit Ray came to be regarded as one of the world's finest film-makers ever. Today, more than a decade after his death, he continues to be India's most respected name in international film circles. Apart from his achievements as a director, Ray was also a prolific writer of novels, short stories, and essays on cinema. Speaking of Films brings together some of Ray's most memorable writings on film and film-making. With the masterly precision and clarity that characterize his films, Ray discusses a wide array of subjects: the structure and language of cinema with special reference to his adaptations of Tagore and Bibhuti Bhushan Bandopadhyay, the appropriate use of background music and dialogue in films, the relationship between a film-maker and a film critic, and important develoents in cinema like the advent of sound and colour. He also writes about his own experiences, the challenges of working with rank amateurs, and the innovations called for when making a film in the face of technological, financial and logistical constraints. In the process, Ray provides fascinating behind-the-scenes glimpses of the people who worked with him the intricacies of getting Chhabi Biswas, who had no ear for music, to play a patron of classical music in Jalsaghar; the incredible memory of the seventy-five-year-old Chunibala Devi, Indir Thakrun of Pather Panchali, and her remarkable attention to details. This first-ever translation of Bishay Chalachitra, a seminal collection of essays on cinema, Speaking of Films retains the lucidity and simplicity that is a hallmark of Ray's writing, and gives an invaluable insight into the mind of a genius."
    },
    {
        "name": "The Essential Rumi",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/0a920cc27_102123.jpg",
        "category": "Poem",
        "language": "English",
        "author": "Coleman Barks",
        "price": "1078",
        "stock": "2",
        "summary": "A compilation of Rumi’s 81 new poems which were never published until now, will leave you feeling ecstatic and spellbound. With a new introduction and new set of poems, the Essential Rumi is sure to occupy your imagination for quite a while."
    },
    {
        "name": "Mrs Funnybones",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/ee93b8c78bd4_120128.gif",
        "category": "Novel",
        "language": "English",
        "author": "Twinkle Khanna",
        "price": "538",
        "stock": "5",
        "summary": "Khanna said that the main characters in the book are 'a few facts, a little fiction, a few decaying brain cells, and a couple of old bones into my brewing cauldron of words.'The book received good reviews with The Times of India stating' The funny bone definitely tickles but at the same time also jabs you hard. 'Subtle observation(s) with a sledgehammer impact.' says Mint. The Huffington Post reviewed the book stating Thank you Mrs. Funnybones for reminding us that life is what you make of it and the most ordinary moments sometimes provide the maximum entertainment and pearls of wisdom. The book highlights anecdotes and the experiences of the author regarding her family, surroundings and the way she handles them. In the whole book, Khanna did not mention her husband by his name."
    },
    {
        "name": "The White Tiger",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/e095a284a_52908.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Aravind Adiga",
        "price": "715",
        "stock": "15",
        "summary": "Balram Halwai narrates his life in a letter, written in seven consecutive nights and addressed to the Chinese Premier, Wen Jiabao. In his letter, Balram explains how he, the son of a puller, escaped a life of servitude to become a successful businessman, describing himself as an entrepreneur. Balram was born in the rural village of Laxmangarh, where he lived with his grandmother, parents, brother and extended family. He is a smart child but is forced to leave school in order to help pay for his cousin's dowry and begins to work in a teashop with his brother in Dhanbad. While working there he begins to learn about India's government and economy from the customers' conversations. Balram describes himself as a bad servant but a good listener and decides to become a driver. After learning how to drive, Balram finds a job driving Ashok, the son of one of Laxmangarh's landlords. He takes over the job of the main driver, from a small car to a heavy-luxury described Honda City. He stops sending money back to his family and disrespects his grandmother during a trip back to his village. Balram moves to New Delhi with Ashok and his wife Pinky Madam. Throughout their time in Delhi, Balram is exposed to extensive corruption, especially in the government. In Delhi, the contrast between the poor and the wealthy is made even more evident by their proximity to one another. One night Pinky Madam takes the wheel from Balram, while drunk, hits something in the road and drives away; we are left to assume that she has killed a child. Ashok's family puts pressure on Balram to confess that he had been driving alone. Ashok becomes increasingly involved in bribing government officials for the benefit of the family coal business. Balram then decides that killing Ashok will be the only way to escape India's Rooster Coop. After bludgeoning Ashok with a bottle and stealing a large bribe, Balram moves to Bangalore, where he bribes the police in order to help start his own taxi business. Ashok too is portrayed to be trapped in the metaphorical Rooster Coop: his family controls what he does and society dictates how he acts. Just like Ashok, Balram pays off a family whose son one of his taxi drivers hit and killed. Balram explains that his own family was almost certainly killed by Ashok's relatives as retribution for his murder. At the end of the novel, Balram rationalizes his actions and considers that his freedom is worth the lives of his family and of Ashok. And thus ends the letter to Jiabao, letting the reader think of the dark humour of the tale, as well as the idea of life as a trap introduced by the writer."
    },
    {
        "name": "If Tomorrow Comes",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/94b9e28d8_53148.jpg",
        "category": "Fantasy and adventure",
        "language": "English",
        "author": "Sidney Sheldon",
        "price": "718",
        "stock": "3",
        "summary": "This is a story of intrigue and revenge. Tracy Whitney is young, beautiful and intelligent - and about to marry into wealth and glamour. Until, suddenly, she is betrayed, framed by a ruthless Mafia gang, abandoned by the man she loves. Only her ingenuity saves her and helps her fight back."
    },
    {
        "name": "The Ballad of Ayesha",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/f68082fba_164951.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Anisul Hoque, Inam Ahmed (Translator)",
        "price": "538",
        "stock": "13",
        "summary": "Dhaka. 2 October 1977. A military coup is thwarted, but the exact sequence of events is shrouded in mystery. Soon after, Ayesha Begum, recovering from the birth of her second child, receives a letter from the air force stating that her husband Joynal Abedin has been sentenced to death, convicted of insurgency. But has the verdict been carried out? If it was, when and where was he executed? If he was indeed hanged, what has happened to his body? Trying to find answers to these questions, Ayesha embarks on a long and arduous quest to search for her husband, reminiscent of Behula’s epic journey in her effort to resurrect her dead husband Lakhinder in the Bengali folktale Manashamangal. Set against the backdrop of a raging famine, political assassinations and coups that took Bangladesh by storm right after its independence in 1971, Anisul Hoque’s The Ballad of Ayesha is as much a story of the newly created nation as it is the story of its people."
    },
    {
        "name": "Fifty Shades of Grey",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/774fe2aa9_84488.jpg",
        "category": "Novel",
        "language": "English",
        "author": "EL James",
        "price": "898",
        "stock": "6",
        "summary": "The protagonist of this book is a young, naive college student of twenty one years named Anastasia Steele. Anastasia acquiesces to interview a 27 year old business magnate named Christian Grey in lieu of her ill roommate and best friend, Katharine Kavanaugh. What she doesn’t count on, however, is how attracted yet intimidated she is by him. She nervously rushes through the interview and then pushes all thoughts of him to the back of her mind. She was counting on the fact that their paths might never cross again. Christian Grey, in the meantime, is equally taken in by the innocent Anastasia. A man with a fervent need to be in control, he is constantly battling his inner demons. He visits her at her part-time job and agrees to do a photo shoot to accompany the article Kate was writing on him. At the photoshoot, he asks her out for coffee, and the process of the pair getting acquainted with each other begins. However, Christian does not plan on indulging in a typical relationship. He presents Anastasia with a full non-disclosure statement that she must sign in order to continue seeing him. The contract contains clauses about a purely physical, non-romantic, dominant/submissive relationship. Anastasia, initially taken aback, is intrigued nonetheless and decides to give it a shot. Fifty Shades Of Grey proceeds with a racy and fast-paced story thereafter, as the couple try to work past their obvious incompatibility. Intended for mature readers, it delves into the carnal practises of bondage and dominance. The novel topped bestseller lists across the globe, and has sold over ninety million copies worldwide. It has also been translated into over fifty two languages, and is being adapted into a film which is scheduled to release in early 2015."
    },
    {
        "name": "The Fifth Mountain",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/ce427021c_56203.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Paulo Coelho",
        "price": "718",
        "stock": "3",
        "summary": "The Fifth Mountain is set in the year 870 BC. Israel is being ruled by Phoenicians and Queen Jezebel wants to ensure that the people follow her own faith, one she brought from her native land. So, she orders the death of all those who do not bow down to her God, Baal. One of these rebels is the Prophet Elijah. The Queen orders his death for refusing to obey her. Elijah flees to the lovely Phoenician city of Zarephath, which is also known by the Phoenician name of Akbar. This place was actually considered to be the abode of the God, though Elijah refused to acknowledge it. There he meets a woman who is a worshipper of Baal. Though their religious views differ and she is older than him, Elijah and the woman are attracted to each other. But they don't discuss their feelings openly. Meanwhile, Elijah, who has been sent to this place by an angel, wants to rid Israel of the tyranny of Queen Jezebel. But due to a surprising turn of events, the people of Akbar accept him as a sage. They consider him one of their own and come to him for advice and to settle disputes. As Elijah begins to bond with these people, he suffers from conflicting ambitions. He cannot decide whether to remain in Akbar, his adopted city, or to return to Israel. Subsequently, the destructive Assyrian invasion on Akbar worsens Elijah’s dilemma. In The Fifth Mountain, through the context of a religious tale, the author conveys the importance of finding one's own destiny, even if it seems like it will involve rebelling against God's will. He insists that in doing so, one will find oneself getting closer to God."
    },
    {
        "name": "Windmills of the Gods",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/06a4c16ed9f4_99887.jpg",
        "category": "Fantasy and adventure",
        "language": "English",
        "author": "Sidney Sheldon",
        "price": "718",
        "stock": "5",
        "summary": "Stanton Rogers was destined to be President of the United States. He was a charismatic politician, highly visible to an approving public, and backed by powerful friends. Unfortunately for Rogers, his libido got in the way of his career. Or, as the Washington mavens put it: 'Old Stanton fucked himself out of the Presidency. It was not that Stanton Rogers fancied himself a Casanova. On the contrary, until that one fatal bedroom escapade, he had been a model husband. He was handsome, wealthy, and on his way to one of the most important positions in the world, and although he had had ample opportunity to cheat on his wife, he had never given another woman a thought."
    },
    {
        "name": "The Art of War : The New Translation",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/80f558233_149177.jpg",
        "category": "History",
        "language": "English",
        "author": "Sun Tzu",
        "price": "990",
        "stock": "15",
        "summary": "The Art of War is an ancient Chinese military treatise dating from the Late Spring and Autumn Period (roughly 5th century BC). The work, which is attributed to the ancient Chinese military strategist Sun Tzu ('Master Sun', also spelled Sunzi), is composed of 13 chapters. Each one is devoted to an aspect of warfare and how it applies to military strategy and tactics. For almost 1,500 years it was the lead text in an anthology that would be formalised as the Seven Military Classics by Emperor Shenzong of Song in 1080. The Art of War remains the most influential strategy text in East Asian warfare[1] and has influenced both Eastern and Western military thinking, business tactics, legal strategy and beyond. This book contained a detailed explanation and analysis of the Chinese military, from weapons and strategy to rank and discipline. Sun Tzu also stressed the importance of intelligence operatives and espionage to the war effort. Because Sun Tzu has long been considered to be one of history's finest military tacticians and analysts, his teachings and strategies formed the basis of advanced military training for centuries to come."
    },
    {
        "name": "Percy Jackson and the Sea of Monsters",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/805a798a3_52646.jpg",
        "category": "Fantasy and adventure",
        "language": "English",
        "author": "Rick Riordan",
        "price": "754",
        "stock": "3",
        "summary": "'The Sea of Monsters' by Rick Riordan is the second book in the 'Percy Jackson and the Olympians' series. In this book, Percy Jackson takes on a quest to save his beloved Camp Half Blood. This book is a tale of Good vs Evil as seen from the point of view of Percy. He must not only fight for the camp but the lives of those around him that he cares about. This book combines the current world with the world of the Greek mythological gods such as Zeus and Poseidon. Percy Jackson is seen nearing the end of his seventh grade year and although excited about being done with the school, and going to Camp Half Blood for the summer, Percy is concerned about a vivid dream he has had regarding his friend Grover. Percy is not sure what the dream has meant but ultimately decides he has to focus on school. When Percy arrives at school he and his friend, Tyson, are bullied by a group of new boys that have arrived. Tyson tells Percy that the boys have a funny smell and soon the boys begin to develop into large monsters and attack Percy. Tyson comes to Percy's rescue and soon Percy's friend Annabeth also arrives to help and they soon destroy the monsters, and the school. Percy, Annabeth, and Tyson leave to go to Camp Half-Blood immediately. When they arrive Percy finds that someone has poisoned the magical tree that was created out of Thalia, Zeus' daughter, was injured. Thalia's tree protects Camp Half-Blood but since it is weakened the campers are under constant attack from various monsters. When Percy arrives at Camp he looks at Tyson and realizes he is not a big silly kid, but is in fact a cyclops and in addition to this is also the son of Poseidon, making Tyson Percy's half-brother. Percy and the others at Camp are ordered not go out to find Grover, even though Percy has decided that Grover needs his help and may have a cure for Thalia's tree. Hermes arrives and helps Percy, Tyson, and Annabeth leave camp to go on their quest."
    },
    {
        "name": "Good Night Stories For Rebel Girls",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/ee738b4bd_151675.jpg",
        "category": "Science fiction",
        "language": "English",
        "author": "Elena Favill, Francesca Cavallo",
        "price": "1977",
        "stock": "1",
        "summary": "If you're worried that your children experience a lack of female role models in the worlds of science, politics, the arts, history, sport and technology, worry no more! Featuring a brief summary of the work and lives of 100 historical and contemporary great women, as well as many unknowns, the breadth and diversity - not to mention stunning and varied illustration - of this hefty hardback is admirable. The 'once upon a time' bedtime story style text is very much aimed at a younger primary audience, and provides a really good start for young minds who will want more details when they get a bit older. Because the text is written as a story, parents and carers will have to remind children that these are in fact real accounts of real women, and be all the more inspired for it."
    },
    {
        "name": "The Secrets",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/9cd60322c_52681.jpg",
        "category": "Phycology",
        "language": "English",
        "author": "Rhonda Byrne",
        "price": "1438",
        "stock": "2",
        "summary": "In this book, you'll learn how to use The Secret in every aspect of your life -- money, health, relationships, happiness, and in every interaction you have in the world. You'll begin to understand the hidden, untapped power that's within you, and this revelation can bring joy to every aspect of your life. Supporters will hail this New Age self-help book on the law of attraction as a groundbreaking and life-changing work, finding validation in its thesis that one's positive thoughts are powerful magnets that attract wealth, health, happiness... and did we mention wealth? Detractors will be appalled by this as well as when the book argues that fleeting negative thoughts are powerful enough to create terminal illness, poverty and even widespread disasters. The Secret contains wisdom from modern-day teachers -- men and women who have used it to achieve health, wealth, and happiness. By applying the knowledge of The Secret, they bring to light compelling stories of eradicating disease, acquiring massive wealth, overcoming obstacles, and achieving what many would regard as impossible. This work summarizes the central message and key insights presented in the original book."
    },
    {
        "name": "The Good Earth",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/0f03923fa_91049.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Pearl S. Buck",
        "price": "718",
        "stock": "3",
        "summary": "Set in a pre-World War I age, the novel tells the story of Wang Lung, a Chinese peasant. Beginning with his wedding to O-Lan, a slave of the House of Hwang, the story follows Wang Lung as he makes and breaks his fortunes. Devastated by abject poverty, Wang Lung moves with his family to the city where they survive off charity. The novel dwells on the lives of Chinese peasants and shows them in a light that western literature had not dared to before. The difficulties that Wang Lung and his family go through, involving heartbreaking scenes where his wife is forced to choose between raising her children in poverty or in ending their life the moment they are born showcase the hardship that plagued pre-World War I China. This novel was adapted into an Oscar winning hit movie in 1937 and was largely a factor in helping the relations between the West and China before the battle with Japan."
    },
    {
        "name": "The Greatest Salesman in the World",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/f651834bc_52784.jpg",
        "category": "Biography",
        "language": "English",
        "author": "OG Mandino",
        "price": "405",
        "stock": "2",
        "summary": "Each generation produces its 'literature of power.' This type of writing literally has the power to change the reader's life. In this tradition, The Greatest Salesman In The World is destined to influence countless lives. Here is the legend of Hafid, a camel boy of two thousand years ago, and his burning desire to improve his lowly position in life. To prove his potential ability, he is dispatched from Bethlehem by his master, the great caravan merchant, Pathros, to sell only one robe. He fails and instead, in a moment of pity, gives the robe to warm a newborn baby in a cave near the inn. Hafid returns to the caravan in shame but is accompanied by a bright star shining above his head. This phenomenon is interpreted by Pathros to be a sign from the gods, and he gives Hafid ten ancient scrolls, which contain the wisdom necessary for the boy to achieve all his ambitions. This timeless story also presents the complete writings from the original scrolls. Hafid applied their secrets of success to become the greatest salesman in the world... and what they accomplished for him they can also achieve for you... for we are all “salesmen”... and the success we attain in life depends greatly on how we “sell” ourselves to others."
    },
    {
        "name": "The Master-Key To Riches",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/a38f6f06a_71533.jpg",
        "category": "Philosophy",
        "language": "English",
        "author": "Napoleon Hill",
        "price": "288",
        "stock": "21",
        "summary": "The millions men and women who are grateful to Napoleon Hill for his great bestseller, Think and Grow Rich, will gain not only new inspiration, but a positive, driving determination for self improvement and success from these power-packed pages. Based on the Carnegie formula for money-making, The Master-Key to Riches describes in step-by-step detail today's greatest practical philosophy of success... This amazing philosophy organized from the success experiences of hundreds of the world's most powerful and wealthy men, will show you how to succeed in any walk of life. There is but one sure way to riches, and that may be attained only by those who have The Master-Key to Riches. This Master-Key is a marvelous device which can be used to unlock the door to an exciting new world. It is offered to you here in the pages of this extraordinary book. Read it. It will change your whole life...for the better."
    },
    {
        "name": "Starry Nights",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/Starry_Nights-Shobhaa_De-1d492-53131.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Shobhaa De",
        "price": "630",
        "stock": "9",
        "summary": "“The Starry Night” shows Sexton’s identification with another tortured and suicidal artist, Vincent van Gogh. The short, free-verse poem begins with an epigraph from one of van Gogh’s letters to his brother. “That does not keep me from having a terrible need of—shall I say the word—religion,” van Gogh wrote. “Then I go out at night to paint the stars.” Sexton used epigraphs from a variety of works to begin her poems, and the epigraphs are often of major importance, pointing to a main theme of the poem that might otherwise be overlooked. Here she is indicating that she shares not only the mental imbalance, suicidal tendencies, and artistic nature of the Dutch artist but also his unsatisfied desire for the spiritual. When van Gogh wrote the letter to his brother, he was painting the masterpiece Starry Night on the Rhone, which is described in the poem. The painting captures the night sky in blues and blacks, with a swirl of violent orange representing the moon, and burning yellow-white stars. One would expect a peaceful scene from the title, but this painting is intensely disquieting. The movement seems to be a great rush skyward, the sleeping town beneath the sky unconscious of this spiraling of all nature toward infinity. Sexton sees this painting as a reflection of her own death wish. The dark tree at the edge of the painting is described as “black-haired”—Sexton was a brunette—and it “slips/ up like a drowned woman into the hot sky.” To make her meaning clearer, she continues, “This is how/ I want to die.” The poem interprets the painting as presenting a nature that is animate and hostile. Nevertheless, the picture attracts the speaker, because nature’s brute force promises death, release from the burden of self. Sexton sees the central moon image in the painting as a great dragon that will suck her up into its being. She desires, she says, “to split/ from my life with no flag,/ no belly,/ no cry”—to merge silently and painlessly with the infinite. The images may suggest not a rediscovery of religion but a terrifying substitute for it. Part of the appeal of this poem lies in the vivid interpretation of the painting and in the kinship the reader sees between Sexton and van Gogh."
    },
    {
        "name": "Gone With The Wind",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/Gone_With_The_Wind-Margaret_Mitchell-daa30-101069.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Margaret Mitchell",
        "price": "458",
        "stock": "3",
        "summary": "Scarlett O’Hara is the daughter of a plantation owner. After the Sherman’s March to the Sea, she finds herself to be poverty-ridden. She does everything she can in her power to get out of her situation. The man Scarlett wants to marry is about to marry his cousin, Melanie. Upset by this, and desperate to be by his side for life, she begs him to choose her over the other woman. The tale can be seen as a sort of coming-of-age story with it’s title taken from an Ernest Dowson poem."
    },
    {
        "name": "Modern India 1885-1947",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/93514052a_152823.jpg",
        "category": "History",
        "language": "English",
        "author": "Sumit Sarkar",
        "price": "736",
        "stock": "3",
        "summary": "Modern India provides an insight into the historiography of India and its freedom struggle from the colonial era to the year of Independence. It uses archival data from various sources and collates it with new research elements in the history of the period. As a result, it has been able to provide a critical perspective on the historical, political, social and cultural events of the time. The book is credited as one of the most widely read books on the topic and has changed our understanding of modern Indian history. It is already prescribed in the following 18 Universities in India as principal text. (It also appears as supplementary text in other Universities). Recommended Reading: Calicut University, Calcutta University, Gauhati University, Delhi University, Aligarh Muslim University, MDU Rohtak, VBSPU, Kota University, CCS University, Kashmir University, MLSU Ajmer, JNVU, Gujarat University, Mumbai University, North Maharashtra University, Baroda University, Christ University, Kannaur University"
    },
    {
        "name": "The Algebra of Infinite Justice",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/4ffb2849a084_52482.jpg",
        "category": "Research",
        "language": "English",
        "author": "Arundhati Roy",
        "price": "450",
        "stock": "13",
        "summary": "He Algebra of Infinite Justice (2001) is a collection of essays written by Booker Prize winner Arundhati Roy. The book discusses several perspectives of global and local concerns, among them one being the abuse of Nuclear bomb showoffs. The book discusses several issues from fields as diverse as the political euphoria in India over its successful nuclear bomb tests, the 'power' politics wherein she discusses the power generating companies of the world manipulating the laws and policies of the many power-deprived nations. A few weeks after India detonated a thermonuclear device in 1998, Arundhati Roy wrote ‘The End of Imagination’. The essay attracted worldwide attention as the voice of a brilliant Indian writer speaking out with clarity and conscience against nuclear weapons. Over the next three and a half years, she wrote a series of political essays on a diverse range of momentous subjects: from the illusory benefits of big dams, to the downside of corporate globalization and the US Government’s war against terror. First published in 2001, The Algebra of Infinite Justice brings together all of Arundhati Roy’s political writings so far. This revised paperback edition includes two new essays, written in early 2002: ‘Democracy: Who’s She When She’s at Home’, that examines the horrific communal violence in Gujarat, and ‘War Talk: Summer Games with Nuclear Bombs’, about the threat of nuclear war in the Subcontinent."
    },
    {
        "name": "Master of the Game",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/49a1690dd_53162.jpg",
        "category": "Fantasy and adventure",
        "language": "English",
        "author": "Sidney Sheldon",
        "price": "718",
        "stock": "1",
        "summary": "One of Sidney Sheldon's most popular and bestselling titles, repackaged and reissued for a new generation of fans. Kate Blackwell is one of the richest and most powerful women in the world. She is an enigma, a woman surrounded by a thousand unanswered questions. Her father was a diamond prospector who struck it rich beyond his wildest dreams. Her mother was the daughter of a crooked Afrikaaner merchant. Her conception was itself an act of hate-filled vengeance. At the extravagent celebrations of her ninetieth birthday, there are toasts from a Supreme Court Judge and a telegram from the White House. And for Kate there are ghosts, ghosts of absent friends and of enemies. Ghosts from a life of blackmail and murder. Ghosts from an empire spawned by naked ambition! Sidney Sheldon is one of the most popular storytellers in the world. This is one of his best-loved novels, a compulsively readable thriller, packed with suspense, intrigue and passion. It will recruit a new generation of fans to his writing."
    },
    {
        "name": "Problem at Pollensa Bay",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/8350f953c_53099.jpg",
        "category": "Mystery and thriller",
        "language": "English",
        "author": "Agatha Christie",
        "price": "630",
        "stock": "3",
        "summary": "In this compilation of eight marvellous short stories, Agatha Christie delights readers with the presence of her three male sleuths in six respective stories. Two stories each for Parker Pyne, the duo Harley Quin-Satterthwaite and Hercule Poirot ‘the police hound.’ In the two other, two women on a crossroads of their life are faced with difficult decision to make. The map of Majorca, Spain where Parker Pyne has to resolve a rift between two women while on holiday. Presumably first appeared in the UK magazines, seven of them were written in the twenties and in the thirties. Only The Harlequin Tea Set was in 1971. Interestingly, the copyright of five of them were signed as Mrs. Mallowan; hence after her divorce in 1928. Poirot’s cases concern with a reconstruction of a suicide and the death of an old eccentric well-to-do man who summons the Belgian to his home. In the former story, it starts when he receives a telephone call from a mysterious woman begging for his help. ‘…table with yellow irises,’ she sounds frightened of being overheard. In the latter, a shot is heard moments after the first gong for dinner but a guest firmly believes of having heard the second gong. Four years later the same plot appears in Dead Man’s Mirror (see Notes On The Murder In The Mews) with alterations to the character names. In the non-detective stories, two female protagonists must make her choice. On the one hand, it is between a dog or starvation in Next To A Dog; the dog being the very memory of a dead husband. On the other, Theodora Darrel undergoes a battle of will between loyalty vs happiness. Will she still walk out from her marriage having known that her husband has been in a serious charge of theft and fraud? The Love Detectives (1926) seems to mark the early appearance of Harley Quin; an enigmatic man of whom his path is crossed with Mr. Satterthwaite’s on a number of occasions (see Notes On The Mysterious Mr. Quin). In a dark night both meets when their car collide; Sattwerthwaite is with Colonel Melrose on their way to a crime scene. An aristocrat has been killed with a bronze figure of Venus. Then his beautiful wife and a male guest whom stays over in the house confess of the murder. Who is one to believe?"
    },
    {
        "name": "Heroes of Olympus The Son of Neptune",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/9aa6d687b614_84555.jpg",
        "category": "Fantasy and adventure",
        "language": "English",
        "author": "Rick Riordan",
        "price": "641",
        "stock": "8",
        "summary": "Heroes Of Olympus: The Son Of Neptune takes the story forward from where the previous novel in the series The Lost Hero ended. As Percy Jackson wakes up from his long sleep, he is confused and does not remember much from his past. The only thing he remembers is his name and a person from his past with the name Annabeth. As the son of Poseidon, Percy Jackson wakes up to the reality of his life that is a chaotic world of monsters, gods, and demigods. He realizes that he is followed by two snake-haired women who are hard to get rid of. He travels to the camp for the half-bloods which confuses him as he does not understand his purpose yet. He meets the wolf Lupa who informs him about his true identity, that of a demigod and teaches him how to use his pocket sword to fight. Still, Percy’s mind does not give him any clear clues about his past and the vision is still blurred. The only thing the reader is sure about is that the quest followed by Percy and other demigods Hazel and Frank – the one that began in the previous books of the series – is still on. The search for the Prophesy of Seven has to be accomplished at any cost. They cannot fail in their mission or else many lives and the world might be on the verge of complete destruction. Heroes Of Olympus: The Son Of Neptune begins with another camp for half-bloods and takes the reader to the land that is much beyond that of the gods. It brings into action new creatures including demigods and frightening monsters who have a role to play in the Prophesy of Seven. And thus, like its previous volumes, even this one is fascinating enough to keep the reader hooked till the last page. Heroes Of Olympus: The Son Of Neptune was well received, and it was listed on the bestsellers list of USA Today, The New York Times, and The Wall Street Journal. It has sold more than three million copies."
    },
    {
        "name": "Medea and Other Plays",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/908eca756_86081.jpg",
        "category": "Drama",
        "language": "English",
        "author": "Euripides",
        "price": "538",
        "stock": "6",
        "summary": "Runs cold to think What plots you may be nursing deep within your heart' The four tragedies collected in this volume all focus on a central char acter, once powerful, brought down by betrayal, jealousy, guilt and hatred. The first playwright to depict suffering without reference to the gods, Euripides (484-407 BC) made his characters speak in human terms and face the consequences of their actions. In Medea, a woman rejected by her lover takes hideous revenge by murdering the children they both love, and Hecabe depicts the former queen of Troy, driven mad by the prospect of her daughter's sacrifice to Achilles. Electra portrays a young woman planning to avenge the brutal death of her father at the hands of her mother, while in Heracles the hero seeks vengeance against the evil king who has caused bloodshed in his family."
    },
    {
        "name": "The remain of the day",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/b1f386631_84675.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Kazuo Ishiguro",
        "price": "1078",
        "stock": "1",
        "summary": "Stevens is an English butler who has spent most of his life serving Lord Darlington. Now working for a new employer, the distinguished Mr. Farraday, Stevens receives a letter from a former colleague, the housekeeper Miss Kenton. In the letter, she describes her married life, which Stevens interprets as an unhappy one. To Stevens, the letter arrives with a chance to revisit both a lost relationship and the possibility of re-employment. Mr. Farraday believes Stevens wants to go on a motoring trip and lends him his car for a well-deserved break. Along the ride, Stevens reminisces about his past relationship with Miss Kenton. Along the course of the novel, it becomes apparent that they once had feelings for one another, but they had never admitted this to one another. Can Stevens return to Lord Darlington’s service and find the closure he desperately seeks?"
    },
    {
        "name": "Wuthering Heights",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/Wuthering_Heights-Emily_Bronte-000fb-220164.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Emily Bronte",
        "price": "354",
        "stock": "11",
        "summary": "1801—I have just returned from a visit to my landlord, the solitary neighbor that I shall be troubled with. This is certainly a beautiful country! In all England, I do not believe that I could have fixed on a situation so completely removed from the stir of society. A perfect misanthropist's Heavenand Mr. Heathcliff and I are such a suitable pair to divide the desolation between us. A capital fellow! He little imagined how my heart warmed towards him when I beheld his black eyes withdraw so suspiciously under their brows, as I rode up, and when his fingers sheltered themselves, with a jealous resolution, still further in his waistcoat, as I announced my name. Mr. Heathcliff?' I said. A nod was the answer. ‘Mr. Lockwood, your new tenant, sir. I do myself the honor of calling as soon as possible after my arrival, to express the hope that I have not inconvenienced you by my perseverance in soliciting the occupation of Thrushcross Grange: I heard yesterday you had had some thoughts. “Thrushcross Grange is my own, sir,” he interrupted, wincing. 'I should not allow anyone to inconvenience me, if I could hinder it-walk in! The 'walk in' was uttered with closed teeth, and expressed the sentiment, 'Go to the Deuce!' Even the gate over which he leant manifested no sympathizing movement to the words; and I think that circumstance determined me to accept the invitation: I felt interested in a man who seemed more exaggeratedly reserved than myself. When he saw my horse's breast fairly pushing the barrier, he did put out his hand to unchain it, and then sullenly."
    },
    {
        "name": "Ruttie Jinnah",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/Ruttie_Jinnah-Saad_S_Khan-08dc1-221990.jpg",
        "category": "Biography",
        "language": "English",
        "author": "Saad S. Khan, Sara S. Khan",
        "price": "1078",
        "stock": "1",
        "summary": "Did Mohammad Ali Jinnah's wife, Ruttie, impact the creation of Pakistan? Did she have a posthumous influence on Pakistan's polity? Does her legacy still affect Indo-Pak relations? Ruttie Jinnah was a fierce nationalist in her own right and a proactive political companion to her husband. According to Jinnah's contemporary political leader Sarojini Naidu, Ruttie was the only one with whom he could truly be himself. Much to the dismay of her family and the Parsee community she hailed from, she had a love marriage with Jinnah. However, despite her undisputed influence on him, she remains an understudied figure in history. This vivid biography-put together over twelve years of research, interviews with historians, family members and lawyers of Jinnah's descendants, and visits to every place associated with the couple in India, Pakistan and England-provides an incisive look into Ruttie's life and legacy, bringing forth a novel and fresh understanding of Jinnah and the freedom movement."
    },
    {
        "name": "Wedding Night",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/ad2c8d3b4_174387.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Sophie Kinsella",
        "price": "1368",
        "stock": "1",
        "summary": "Lottie just knows that her boyfriend is going to propose, but then his big question involves a trip abroad — not a trip down the aisle. Completely crushed, Lottie reconnects with an old flame, and they decide to take drastic action. No dates, no moving in together, they’ll just get married . . . right now. Her sister, Fliss, thinks Lottie is making a terrible mistake, and will do anything to stop her. But Lottie is determined to say “I do,” for better, or for worse."
    },
    {
        "name": "Wedding Night",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/ad2c8d3b4_174387.jpg",
        "category": "Novel",
        "language": "English",
        "author": "Sophie Kinsella",
        "price": "1368",
        "stock": "1",
        "summary": "Lottie just knows that her boyfriend is going to propose, but then his big question involves a trip abroad — not a trip down the aisle. Completely crushed, Lottie reconnects with an old flame, and they decide to take drastic action. No dates, no moving in together, they’ll just get married . . . right now. Her sister, Fliss, thinks Lottie is making a terrible mistake, and will do anything to stop her. But Lottie is determined to say “I do,” for better, or for worse."
    },
    {
        "name": "A Horse Walks into a Bar",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/30614f079_162245.jpg",
        "category": "Research",
        "language": "English",
        "author": "David Grossman",
        "price": "846",
        "stock": "2",
        "summary": "The award-winning and internationally acclaimed author of the To the End of the Land now gives us a searing short novel about the life of a stand-up comic, as revealed in the course of one evening's performance. In the dance between comic and audience, with barbs flying back and forth, a deeper story begins to take shape--one that will alter the lives of many of those in attendance."
    },
    {
        "name": "Opposing the Money Lenders",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/f3012ff0a_190332.jpg",
        "category": "Business",
        "language": "English",
        "author": "Ezra Pound, Gottfried Feder",
        "price": "2984",
        "stock": "1",
        "summary": "Opposing the Money Lenders is a collection of writings from some of the most determined fighters against usury and the Central Banking system during the 20th Century. Those included are Arthur Nelson Field, John A. Lee, John Hargrave, Ezra Pound, Father Charles Coughlin, and Gottfried Feder, who fought and inspired mass movements that struggled to liberate their nations from the forces of what one - Gottfried Feder - aptly called 'Mammonism'. The subject of the supply of our money, and who controls it, is the greatest social issue that confronts humanity today. It is the 'Hidden Hand' behind history. Without dealing with the problems of banking and usury, without a people having control over its own means of credit and exchange, there can be no genuine nationhood, and no real freedom, whether personal or national. Almost every individual, family, nation, indeed most of the world, is in thrall to the money lenders. Despite advances in mechanisation and technology, people are working longer hours, and are more enslaved to the economic treadmill than were their ancestors in Medieval times. At the same time, despite mass education, people today understand the economic and financial system far less than their parents and grandparents. Opposing the Money Lenders examines our parasitic financial system and the means by which it might be replaced."
    },
    {
        "name": "Warrior Bronze",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/1c7a99c96_155659.jpg",
        "category": "Fantasy and adventure",
        "language": "English",
        "author": "Michelle Paver",
        "price": "630",
        "stock": "3",
        "summary": "Hylas has returned to his homeland, and the fate of the world rests on his shoulders: He must find the prophesized dagger of Koronos and keep the Crows from wielding it in battle, or they will rule the land forever. But he must also locate Issi, his lost sister, to keep her safe from the impending war. Torn between his duty and his family, Hylas and Pirra split up to conquer their tasks. But fate has many surprises for them, and neither challenge is as straightforward as it seems. Aided by Havoc the lioness, Echo the falcon, and many old friends, Hylas and Pirra must defeat the Crows once and for all—or lose everything trying."
    },
    {
        "name": "Directorate S: The C.I.A. and America's Secret Wars in Afghanistan and Pakistan",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/7a18cc2e8_165477.jpg",
        "category": "History",
        "language": "English",
        "author": "Michelle Paver",
        "price": "1798",
        "stock": "1",
        "summary": "Prior to 9/11, the United States had been carrying out small-scale covert operations in Afghanistan, ostensibly in cooperation, although often in direct opposition, with I.S.I., the Pakistani intelligence agency. While the US was trying to quell extremists, a highly secretive and compartmentalized wing of I.S.I., known as Directorate S, was covertly training, arming, and seeking to legitimize the Taliban, in order to enlarge Pakistan's sphere of influence. After 9/11, when fifty-nine countries, led by the U. S., deployed troops or provided aid to Afghanistan in an effort to flush out the Taliban and Al Qaeda, the U.S. was set on an invisible slow-motion collision course with Pakistan. Today we know that the war in Afghanistan would falter badly because of military hubris at the highest levels of the Pentagon, the drain on resources and provocation in the Muslim world caused by the U.S.-led invasion of Iraq, and corruption. But more than anything, as Coll makes painfully clear, the war in Afghanistan was doomed because of the failure of the United States to apprehend the motivations and intentions of I.S.I.'s Directorate S. This was a swirling and shadowy struggle of historic proportions, which endured over a decade and across both the Bush and Obama administrations, involving multiple secret intelligence agencies, a litany of incongruous strategies and tactics, and dozens of players, including some of the most prominent military and political figures. A sprawling American tragedy, the war was an open clash of arms but also a covert melee of ideas, secrets, and subterranean violence. Coll excavates this grand battle, which took place away from the gaze of the American public. With unsurpassed expertise, original research, and attention to detail, he brings to life a narrative at once vast and intricate, local and global, propulsive and painstaking. This is the definitive explanation of how America came to be so badly ensnared in an elaborate, factional, and seemingly interminable conflict in South Asia. Nothing less than a forensic examination of the personal and political forces that shape world history, Directorate S is a complete masterpiece of both investigative and narrative journalism."
    },
    {
        "name": "The Quran and Politics : A Study of the Origins of Political Thought in the Makkan Quran",
        "img": "https://ds.rokomari.store/rokomari110/ProductNew20190903/260X372/a35f1b7fd_187559.jpg",
        "category": "Research",
        "language": "English",
        "author": "Eltigani Abdelgadir Hamid",
        "price": "1630",
        "stock": "3",
        "summary": "The Quran approaches the issue of political thought as part of a comprehensive discourse which establishes the general goals and frames of reference. It is then left to the human mind to complete these with what it has learned from experiences in history and what the scholars understood from the Text about how to deal with reality. This work is about the origins of political thought and a study of the philosophy of politics. It examines the actions of the state as the main power concerned with public affairs in society, and enquires into which public action is considered good or bad in relation to other value system endorsed by Islam. The work uses a unique methodology to argue that the major elements of the Quranic political thought are securely anchored in the Makkan verses of the Quran. Studying these verses it searches for the rules and principles that help identify the directions and major objectives towards which both human society and political action are guided prior to the rise of institutions and the regulation of relations."
    }
]